In [1]:
import pandas as pd
pd.__version__

'0.23.1'

In [2]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'age': [25,26,27]
})
df = df[['name','age']]
df

      name  age
0    alice   25
1      bob   26
2  charlie   27

## rename

In [3]:
df.rename(columns={'name':'person_name'})

  person_name  age
0       alice   25
1         bob   26
2     charlie   27

In [4]:
df.rename(columns={'name':'person_name','age':'age_in_years'})

  person_name  age_in_years
0       alice            25
1         bob            26
2     charlie            27

## apply function

In [5]:
df2 = df.copy()

df2['name']= df['name'].map(lambda name: name.upper())
df2

      name  age
0    ALICE   25
1      BOB   26
2  CHARLIE   27

## create derived

In [6]:
df2 = df.copy()

df2['age_times_two']= df['age'].map(lambda age: age*2)
df2

      name  age  age_times_two
0    alice   25             50
1      bob   26             52
2  charlie   27             54

In [7]:
df2 = df.copy()

df2['age_times_two']= df['age'] *2
df2

      name  age  age_times_two
0    alice   25             50
1      bob   26             52
2  charlie   27             54

In [8]:
df2 = df.copy()

df2['name_uppercase']= df['name'].map(lambda name: name.upper())
df2

      name  age name_uppercase
0    alice   25          ALICE
1      bob   26            BOB
2  charlie   27        CHARLIE

## number of columns

In [43]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'age': [25,26,27],
    'state': ['ak','ny','dc']
})

print(len(df.columns.values))

3

## change order

In [41]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'age': [25,26,27],
    'state': ['ak','ny','dc']
})
df

   age     name state
0   25    alice    ak
1   26      bob    ny
2   27  charlie    dc

In [42]:
df = df[['name','age','state']]
df

      name  age state
0    alice   25    ak
1      bob   26    ny
2  charlie   27    dc

## dropping

In [9]:
df2 = df.copy()

df2.drop(columns=['age'],inplace=True)
df2

      name
0    alice
1      bob
2  charlie

In [10]:
df2 = df.copy()

df2.drop(columns=['age','name'],inplace=True)
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2]

## append new

In [11]:
df2 = df.copy()

states = pd.Series(['dc','ca','ny'])

df2['state'] = states

df2

      name  age state
0    alice   25    dc
1      bob   26    ca
2  charlie   27    ny

## check if column in dataframe

In [12]:
df2 = df.copy()

candidate_names = ['name','gender','age']

for name in candidate_names:
    if name in df2.columns.values:
        print('"{}" is a column name'.format(name))

"name" is a column name
"age" is a column name

## insert column at specific index

In [13]:
df2 = df.copy()

col = pd.Series(['female','male','male'])

df2.insert(1,'gender',col)
df2

      name  gender  age
0    alice  female   25
1      bob    male   26
2  charlie    male   27

## astype

In [14]:
import numpy as np

df2 = df.copy()

print(df2['age'].dtype)

df2['age'] = df2['age'].astype(str)

print(df2['age'].dtype)

df2['age'] = df2['age'].astype(np.uint8)

print(df2['age'].dtype)

int64
object
uint8

## to datetime

In [15]:
df3 = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'date_of_birth': ['10/25/2005','10/29/2002','01/01/2001']
})[['name','date_of_birth']]
df3

      name date_of_birth
0    alice    10/25/2005
1      bob    10/29/2002
2  charlie    01/01/2001

In [16]:
df3['date_of_birth'] = pd.to_datetime(df3['date_of_birth'])
df3

      name date_of_birth
0    alice    2005-10-25
1      bob    2002-10-29
2  charlie    2001-01-01

In [18]:
df3 = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'date_of_birth': ['27/05/2001','16/02/1999','25/09/1998']
})[['name','date_of_birth']]
df3

      name date_of_birth
0    alice    27/05/2001
1      bob    16/02/1999
2  charlie    25/09/1998

In [27]:
df3 = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'date_of_birth': ['27/05/2001','16/02/1999','25/09/1998']
})[['name','date_of_birth']]
df3
df3['date_of_birth'] = pd.to_datetime(df3['date_of_birth'],format='%d/%m/%Y')
df3

      name date_of_birth
0    alice    2001-05-27
1      bob    1999-02-16
2  charlie    1998-09-25

## apply vs map

In [37]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie'],
    'age': [25,26,27],
    'number_of_children':[1,3,4]
})[['name','age','number_of_children']]
df

      name  age  number_of_children
0    alice   25                   1
1      bob   26                   3
2  charlie   27                   4

In [34]:
df[['name']].apply(lambda row: row.str.capitalize())

      name
0    Alice
1      Bob
2  Charlie

In [35]:
df[['age','number_of_children']].apply(lambda row: row *2)

   age  number_of_children
0   50                   2
1   52                   6
2   54                   8

In [39]:
df['name_upper'] = df['name'].map(lambda element: element.upper())
df

      name  age  number_of_children name_upper
0    alice   25                   1      ALICE
1      bob   26                   3        BOB
2  charlie   27                   4    CHARLIE